#awk_sed  201608021606

########################################
需求：
#将file文件中出现的"1111",依次替换为"a-z"
[root@localhost]# cat file
1111,1111.1111?22222,1111,uuuu,1111
1111,1111.1111?22222,1111,uuuu,1111
1111,1111.1111?22222,1111,uuuu,1111
1111,1111.1111?22222,1111,uuuu,1111
1111,1111.1111?22222,1111,uuuu,1111
#########################################

代码：

[root@localhost]# sed -e's/1111/'{a..d}'/' file
a,b.c?22222,d,uuuu,1111
a,b.c?22222,d,uuuu,1111
a,b.c?22222,d,uuuu,1111
a,b.c?22222,d,uuuu,1111
a,b.c?22222,d,uuuu,1111






[root@localhost]# sed -nr '1{x;s/.*/echo {a..e}/e;x};G;:a;s/1111([^\n]*)\n(\S+) ?/\2\1\n/;ta;P' file
a,b.c?22222,d,uuuu,e
a,b.c?22222,d,uuuu,e
a,b.c?22222,d,uuuu,e
a,b.c?22222,d,uuuu,e
a,b.c?22222,d,uuuu,e



拓展：

#将下面两行内容的第二行字母依次替换第一行的"1111"
1111,1111.1111?22222,1111,uuuu,1111
a b c d e f g


代码：

[root@localhost]# echo -e '1111,1111.1111?22222,1111,uuuu,1111\na b c d e f g'|sed -nr  'N;:a;s/1111([^\n]*)\n(\S+) ?/\2\1\n/;ta;P'
a,b.c?22222,d,uuuu,e
