
#实现当第一列的值等于1时，第二列的值加50； 当第一列的值等于2时，第二列的值加100；当第一列的值等于3时，第二列的值加150；当第一列的值等于100时，第二列的值加170；

##################################
源文件:
[root@local_game_server2 python_learn]# cat file
1 50006
1 60007
1 70008
2 80008
2 90009
3 40007
...
...
....
100 90009
#####################################
结果：
1 50056
1 60057
1 70058
2 80108
2 90109
3 40157
...
...
....
100 90179
######################################
[root@local_game_server2 python_learn]# awk '{for(i=1;i<=100;i++){a[i]=($i!=100)?$2+50*$i:$2+170};print($1 in a)?$1 OFS a[1]:$0}' file
1 50056
1 60057
1 70058
2 80108
2 90109
3 40157
...
...
....
100 90179



