###################################
1).
#实现当第一列的值等于1时，第二列的值加50； 当第一列的值等于2时，第二列的值加100；当第一列的值等于3时，第二列的值加150；当第一列的值等于100时，第二列的值加170；

##################################
源文件:
[root@local_game_server2 python_learn]# cat file
1 50006
1 60007
1 70008
2 80008
2 90009
3 40007
...
...
....
100 90009
#####################################
结果：
1 50056
1 60057
1 70058
2 80108
2 90109
3 40157
...
...
....
100 90179
######################################
[root@local_game_server2 python_learn]# awk '{for(i=1;i<=100;i++){a[i]=($i!=100)?$2+50*$i:$2+170};print($1 in a)?$1 OFS a[1]:$0}' file
1 50056
1 60057
1 70058
2 80108
2 90109
3 40157
...
...
....
100 90179


################################################################
2)
#awk_sed联盟  (20160721)
#装逼每日一题:

需求:  把78A35114F798   变成78:A3:51:14:F7:98
力求最简


#awk

awk 'gsub("..\\B","&:")' <<<"78A35114F798"


awk --re-interval '$0=gensub(/(..)\B/,"\\1:","g",$0)' <<<"78A35114F798"


awk  -F '' '{for(i=0;(i+=2)<NF;)$i=$i":"}1' OFS=''  <<<"78A35114F798"


awk  'RT{s=s!=""?s":"RT:RT}END{print s}' RS='..'  <<<"78A35114F798"


awk  '$1=$1' FIELDWIDTHS="2 2 2 2 2 2" OFS=: <<<"78A35114F798"
(不风骚可以忽略)



#sed
sed 's/..\B/&:/g' <<<"78A35114F798"


sed -r ':a;s/\B\w{2}\b/:&/;ta' <<<"78A35114F798"


#grep

echo '78A35114F798'|grep -Po '..'|xargs|tr ' ' ':'

(不够风骚，可以忽略)


#py

python -c "import re;str='78A35114F798';print ':'.join(re.findall('..',str))"


python -c "import re;str='78A35114F798';print ':'.join([str[x:x+2] for x in range (0,len(str),2)])"
