#seq 20|awk 'i=!i' (取奇数)
1
3
5
7
9
11
13
15
17
19
#seq 20|awk 'i++%2' （取偶数）
2
4
6
8
10
12
14
16
18
20

#seq 20|awk '{print;getline}'（奇数）
1
3
5
7
9
11
13
15
17
19

#seq 20|awk '{getline;print}' （偶数）
2
4
6
8
10
12
14
16
18
20

sed（奇数偶数）

seq 20|sed -n '1~2p' （奇数）
1
3
5
7
9
11
13
15
17
19
[root@liudehua test]# seq 20|sed -n '2~2p' （偶数）
2
4
6
8
10
12
14
16
18
20

sed & awk 取特殊数

#seq 20|sed -n '1~3p'
1
4
7
10
13
16
19
#seq 20|sed -n '1~3!p' <==>等价于 (seq 20|awk 'i++%3')
2
3
5
6
8
9
11
12
14
15
17
18
20
2
3
5
6
8
9
11
12
14
15
17
18
20
#seq 20|awk 'i++%3'
2
3
5
6
8
9
11
12
14
15
17
18
20


